## staging: github
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                                |
|--------|-------------------------------------------------------------------|
| add    | `github_actions_secret.admin_aws_access_key[0]`                   |
|        | `github_actions_secret.admin_aws_secret_access_key[0]`            |
|        | `github_actions_secret.admin_cypress_env_json[0]`                 |
|        | `github_actions_secret.admin_op_service_account_token[0]`         |
|        | `github_actions_secret.admin_pr_review_env_security_group_ids[0]` |
|        | `github_actions_secret.admin_pr_review_env_subnet_ids[0]`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.admin_aws_access_key[0] will be created
  + resource "github_actions_secret" "admin_aws_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-admin"
      + secret_name     = "STAGING_AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.admin_aws_secret_access_key[0] will be created
  + resource "github_actions_secret" "admin_aws_secret_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-admin"
      + secret_name     = "STAGING_AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.admin_cypress_env_json[0] will be created
  + resource "github_actions_secret" "admin_cypress_env_json" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-admin"
      + secret_name     = "CYPRESS_ENV_JSON"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.admin_op_service_account_token[0] will be created
  + resource "github_actions_secret" "admin_op_service_account_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-admin"
      + secret_name     = "OP_SERVICE_ACCOUNT_TOKEN_STAGING"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.admin_pr_review_env_security_group_ids[0] will be created
  + resource "github_actions_secret" "admin_pr_review_env_security_group_ids" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-admin"
      + secret_name     = "PR_REVIEW_ENV_SECURITY_GROUP_IDS"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.admin_pr_review_env_subnet_ids[0] will be created
  + resource "github_actions_secret" "admin_pr_review_env_subnet_ids" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-admin"
      + secret_name     = "PR_REVIEW_ENV_SUBNET_IDS"
      + updated_at      = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
